Revit 2027 API
LoadBase.WorkPlaneId Property
 Id of the work plane which may determine the orientation of the load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId WorkPlaneId { get; }
Public ReadOnly Property WorkPlaneId As ElementId
	Get
public:
property ElementId^ WorkPlaneId {
	ElementId^ get ();
}
member WorkPlaneId : ElementId with get
Property Value
ElementId
Remarks
 The load might be oriented to be perpendicular to this work plane. Determine how load is oriented by checking OrientTo.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace